/*От конзолата се четe 1 ред:
Годишната такса за тренировки по баскетбол – цяло число в интервала [0… 9999]*/
double tax = double.Parse(Console.ReadLine());
//Баскетболни кецове – цената им е 40% по-малка от таксата за една година
double shoes = tax - tax * 0.40;
//Баскетболен екип – цената му е 20% по-евтина от тази на кецовете
double equpment = shoes - shoes * 0.20;
//Баскетболна топка – цената ѝ е 1 / 4 от цената на баскетболния екип
double ball = equpment - equpment * 0.75;
//Баскетболни аксесоари – цената им е 1 / 5 от цената на баскетболната топка
double acsesories = ball - ball * 0.80;
double sum = tax + shoes + equpment + ball + acsesories;
/*Изход
Да се отпечата на конзолата колко ще са разходите на Джеси, ако започне да спортува баскетбол*/
Console.WriteLine(sum);